<script></script>

<template>
    <div class="main">
        <p>Привет! Я основатель социальной сети <span class="logotype">Nettler</span> (ранее известной как Flurr). Если у вас есть какие-то вопросы или предложения, пожалуйста, свяжитесь со мной:</p>
        <div class="links">
            <a class="text-muted" target="_blank" href="https://github.com/Magomed-R">
                <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24">
                    <path
                        d="M12 0c-6.626 0-12 5.373-12 12 0 5.302 3.438 9.8 8.207 11.387.599.111.793-.261.793-.577v-2.234c-3.338.726-4.033-1.416-4.033-1.416-.546-1.387-1.333-1.756-1.333-1.756-1.089-.745.083-.729.083-.729 1.205.084 1.839 1.237 1.839 1.237 1.07 1.834 2.807 1.304 3.492.997.107-.775.418-1.305.762-1.604-2.665-.305-5.467-1.334-5.467-5.931 0-1.311.469-2.381 1.236-3.221-.124-.303-.535-1.524.117-3.176 0 0 1.008-.322 3.301 1.23.957-.266 1.983-.399 3.003-.404 1.02.005 2.047.138 3.006.404 2.291-1.552 3.297-1.23 3.297-1.23.653 1.653.242 2.874.118 3.176.77.84 1.235 1.911 1.235 3.221 0 4.609-2.807 5.624-5.479 5.921.43.372.823 1.102.823 2.222v3.293c0 .319.192.694.801.576 4.765-1.589 8.199-6.086 8.199-11.386 0-6.627-5.373-12-12-12z">
                    </path>
                </svg>
            </a>
            <a class="text-muted" target="_blank" href="https://vk.com/magomedradzhabov2006">
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 30 30" width="32px" height="32px">
                    <path
                        d="M24,4H6C4.895,4,4,4.895,4,6v18c0,1.105,0.895,2,2,2h18c1.105,0,2-0.895,2-2V6C26,4.895,25.105,4,24,4z M21.361,18.967 l-1.868,0.026c0,0-0.403,0.079-0.93-0.285c-0.699-0.48-1.358-1.729-1.872-1.567c-0.521,0.166-0.505,1.29-0.505,1.29 s0.004,0.198-0.115,0.327c-0.129,0.139-0.382,0.125-0.382,0.125h-0.837c0,0-1.846,0.153-3.473-1.543 c-1.772-1.849-3.338-5.498-3.338-5.498s-0.092-0.23,0.006-0.348c0.111-0.13,0.41-0.134,0.41-0.134l2-0.01 c0,0,0.188,0.033,0.324,0.133c0.111,0.082,0.174,0.236,0.174,0.236s0.323,0.819,0.752,1.561c0.836,1.446,1.224,1.763,1.508,1.608 c0.414-0.226,0.29-2.044,0.29-2.044s0.008-0.66-0.208-0.954c-0.168-0.229-0.484-0.297-0.622-0.314 c-0.113-0.015,0.071-0.277,0.311-0.395c0.36-0.176,0.996-0.186,1.747-0.179c0.585,0.006,0.754,0.042,0.982,0.098 c0.69,0.167,0.456,0.811,0.456,2.356c0,0.495-0.089,1.191,0.267,1.42c0.154,0.099,0.529,0.015,1.464-1.579 c0.445-0.756,0.778-1.644,0.778-1.644s0.073-0.158,0.186-0.226c0.116-0.07,0.272-0.048,0.272-0.048l2.105-0.013 c0,0,0.632-0.076,0.735,0.211c0.108,0.3-0.236,1.001-1.096,2.148c-1.412,1.884-1.569,1.709-0.396,2.799 c1.12,1.041,1.351,1.547,1.39,1.611C22.339,18.906,21.361,18.967,21.361,18.967z">
                    </path>
                </svg>
            </a>
            <a class="text-muted" target="_blank" href="https://t.me/a_temp_file">
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 50 50" width="28px" height="28px">
                    <path class="violet"
                        d="M46.137,6.552c-0.75-0.636-1.928-0.727-3.146-0.238l-0.002,0C41.708,6.828,6.728,21.832,5.304,22.445	c-0.259,0.09-2.521,0.934-2.288,2.814c0.208,1.695,2.026,2.397,2.248,2.478l8.893,3.045c0.59,1.964,2.765,9.21,3.246,10.758	c0.3,0.965,0.789,2.233,1.646,2.494c0.752,0.29,1.5,0.025,1.984-0.355l5.437-5.043l8.777,6.845l0.209,0.125	c0.596,0.264,1.167,0.396,1.712,0.396c0.421,0,0.825-0.079,1.211-0.237c1.315-0.54,1.841-1.793,1.896-1.935l6.556-34.077	C47.231,7.933,46.675,7.007,46.137,6.552z M22,32l-3,8l-3-10l23-17L22,32z">
                    </path>
                </svg>
            </a>
        </div>

        <hr>

        <p>Особая благодарность выражается: </p>
        <p><a href="https://t.me/Vavoli9" target="_blank">Ивану Неволину</a></p>

        <p><a href="https://t.me/RacooWho" target="_blank">Павлу Полищуку</a></p>
        <hr>

        <p>На данный момент ведётся работа над улучшением приложения. Спасибо за проявленный интерес к проекту!</p>
        <p style="position: absolute; bottom: 0; text-align: center; right: 0; left: 0;">Текущая версия - 1.1.0</p>
    </div>
</template>

<style lang="scss" scoped>
.main {
    padding: 8px 16px;

    font-size: 18px;

    a {
        text-decoration: none;
    }

    .logotype {
        font-size: 22px;

        animation-name: page-cover;
        animation-duration: 10s;
        animation-timing-function: linear;
        animation-iteration-count: 999;
        animation-direction: alternate;

        @keyframes page-cover {
            0% {
                color: rgb(255, 0, 0);
            }

            25% {
                color: rgb(188, 255, 2);
            }

            50% {
                color: rgb(187, 255, 0);
            }

            75% {
                color: rgb(0, 221, 255);
            }

            100% {
                color: rgb(244, 33, 255);
            }
        }
    }

    .links {
        display: flex;
        justify-content: center;
        align-items: center;
        gap: 30px;
    }
}</style>